/*
Задача №32: Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
[-4, -8, 8, 2] -> [4, 8, -8, 2]
*/

// инициализирует новый массив
int[] InitAray (int length)
{
    int[] array = new int [length];
    Random rnd = new Random();
    for (int i = 0; i < length; i++)
    {
        array[i] = rnd.Next(-9,10);
    }
    return array;
}

// печатает массив на экран
void PrintArray (int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
    Console.WriteLine();
}

//
int[] NewArray (int[] array)
{
    int[] result = new int [array.Length];
    for (int i = 0; i < array.Length; i++)
    {
        result[i] = array[i] * -1;
    }
    return result;
}

int [] array = InitAray(5);
PrintArray(array);
int [] result = NewArray(array);
PrintArray(result);